<a href="https://colab.research.google.com/github/amarildo86/datascience/blob/master/Group_By_Pandas_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

titanic = pd.read_csv("D:\\Data Science Projects\\Titanic\\train.csv")

In [ ]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
titanic['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [ ]:
pclass = pd.DataFrame({'Pobre': [pobre],
                       'Classe Média': [classe_media],
                       'Rico': [rico]})
pclass

   Pobre  Classe Média  Rico
0    216           184   491

In [ ]:
titanic.groupby(['Pclass', 'Survived'])['Pclass'].count()

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: Pclass, dtype: int64

In [ ]:
survived = titanic.groupby(['Sex', 'Survived'])['Sex'].count()
survived

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: Sex, dtype: int64

In [ ]:
wom_surviv = survived[1]
man_surviv = survived[3]

perc_wom_surv = wom_surviv / (wom_surviv + man_surviv)
perc_man_surv = man_surviv / (wom_surviv + man_surviv)

In [ ]:
pd.DataFrame({'% Woman Survived': [np.round(perc_wom_surv, 2)],
              '% Man Survived': [np.round(perc_man_surv, 2)]})

   % Woman Survived  % Man Survived
0              0.68            0.32